[{"Quote": "“This is a common-sense policy to keep our country safe, and frankly, one that is long overdue. This pause will be used to develop an effective vetting process and have it in place so that we can assist refugees without jeopardizing our national security.”", "Stance": "For order", "Name": "Rep. Doug LaMalfa (R-Richvale)", "District": "1", "Source": "Statement"}, {"Quote": "\"Must not tolerate @realDonaldTrump Islamophobiic pandering at expense of innocent people's lives & our constitution. We must make this right\"", "Stance": "Against order", "Name": "Rep. Jared Huffman (D-San Rafael)", "District": "2", "Source": "Twitter"}, {"Quote": "\"Protecting our homeland from foreign terrorist entry has always been a priority of mine. We can do so without rejecting tired and weary families who have already undergone 18 months of intense vetting, praying for peace after fleeing war. Our energy and resources are precious. We should not waste them on policies that cause chaos and heartbreak while failing to make the U.S. safer.\"", "Stance": "Against order", "Name": "Rep. John Garamendi (D-Walnut Grove)", "District": "3", "Source": "Facebook"}, {"Quote": "\"There is no unconditional right to enter the United States, and President Trump has a sworn responsibility to assure that those who do are not hostile to our Constitution or the rule of law. His order is limited to countries that are hot-beds of Islamic extremism and provides for case-by-case waivers to assure that bona fide dissenters from these regimes can still enter. This is a temporary stop-gap to give the administration time to put a new vetting system in place that can adequately assess a refugee’s veracity and intentions.\"", "Stance": "For order", "Name": "Rep. Tom McClintock (R-Elk Grove)", "District": "4", "Source": "Statement"}, {"Quote": "\"This is personal for me. One of my interns was a refugee from Afghanistan. He put his life on the line to help our soldiers. I did everything I could to help him build a new life in America. He's hardworking, dedicated, & we're better for having him in America. It's not right to turn our back on people. This isn't the American way.\"", "Stance": "Against order", "Name": "Rep. Mike Thompson (D-St. Helena)", "District": "5", "Source": "Twitter"}, {"Quote": "\"President Trump’s decision to target immigrants from Muslim-majority countries goes against the essential right to religious liberty that is a founding principle of our nation. We can, and we must, protect Americans while also recognizing the basic humanity of all people.”", "Stance": "Against order", "Name": "Rep. Doris Matsui (D-Sacramento)", "District": "6", "Source": "Statement"}, {"Quote": "\"Law-abiding, documented residents of our country are facing chaos and instability. The uncertainty this has created among workers, students, and at our airports is wreaking havoc on families and businesses. The message this sends internationally does not reflect who we are as a nation of immigrants — we do not close our doors to those who are fleeing persecution, or target people based on their faith.\"", "Stance": "Against order", "Name": "Rep. Ami Bera (D-Elk Grove)", "District": "7", "Source": "Statement"}, {"Quote": "No public comments and none provided when asked", "Stance": "Unclear", "Name": "Rep. Paul Cook (R-Yucca Valley)", "District": "8", "Source": ""}, {"Quote": "“President Trump’s executive order on immigration is a sharp departure from our long and proud history of welcoming immigrants to our nation. It unfairly targets individuals based on their religion and country of origin, hurting both refugees who are fleeing persecution and others who have been valuable aides to our military in the fight against terrorism. This policy has already started tearing apart families and will hurt our national security by giving terrorist groups a significant recruiting tool. We need to stand together to repudiate and overturn this destructive policy.” ", "Stance": "Against order", "Name": "Rep. Jerry McNerney (D-Stockton)", "District": "9", "Source": "Statement"}, {"Quote": "\"Safety & security of our communities come 1st, but the way this EO is playing out has created a lot of uncertainty/unintended consequences. As we have seen with previous administrations, executive orders are not the way to resolve ongoing problems.\"", "Stance": "Critical, but unclear\n", "Name": "Rep. Jeff Denham (R-Turlock)", "District": "10", "Source": "Twitter"}, {"Quote": "\"@POTUS's #MuslimBan executive order is morally reprehensible and unconstitutional! #NoBanNoWall\"", "Stance": "Against order", "Name": "Rep. Mark DeSaulnier (D-Concord)", "District": "11", "Source": "Twitter"}, {"Quote": "\"As the Statue of Liberty holds her torch of welcome high, there are tears in her eyes as she sees how low this Administration has stooped in its callousness toward immigrant families and refugees who have trusted in the laws and protections of the United States.\"", "Stance": "Against order", "Name": "Rep. Nancy Pelosi (D-San Francisco)", "District": "12", "Source": "Statement"}, {"Quote": "\"In week 1 POTUS bans Muslims from entering the country and elevates a white nationalist to the NSC. This is not who we are, we must resist\"", "Stance": "Against order", "Name": "Rep. Barbara Lee (D-Oakland)", "District": "13", "Source": "Twitter"}, {"Quote": "\"Let me be clear, we already do exhaustive vetting that takes approximately 18 months. Many of those detained yesterday were actually American patriots serving the military as translators and aides. The President relishes chaos. We must demand rationality and constitutional respect in the process.\"", "Stance": "Against order", "Name": "Rep. Jackie Speier (D-Hillsborough)", "District": "14", "Source": "Facebook"}, {"Quote": "\"We're not helpless w/ Trump's #MuslimBan. Call your Member of Congress tomorrow and tell them #RefugeesWelcome. Call 202-225-3121. It helps!\"", "Stance": "Against order", "Name": "Rep. Eric Swalwell (D-Dublin)", "District": "15", "Source": "Twitter"}, {"Quote": "\"This executive order is having a devastating impact on hundreds of other individuals and immigrant families that thought the United States would be helping them seek refuge. The vast majority of individuals being detained or prohibited from entering the United States have already been through one of the most extensive vetting processes in the world. Clearly, President Trump’s executive order was not vetted thoroughly by his Administration. Not only is it flawed policy, but it has the potential to be ruled unconstitutional.\"\n", "Stance": "Against order", "Name": "Rep. Jim Costa (D-Fresno)", "District": "16", "Source": "Statement"}, {"Quote": "\"'These are the times that try men's souls.' Congress must not be 'sunshine patriots.' Let's stand up against the unjust bans on refugees.\"", "Stance": "Against order", "Name": "Rep. Ro Khanna (D-Fremont)", "District": "17", "Source": "Twitter"}, {"Quote": "\"The President's Executive Order on refugees is appalling and shameful. #LetThemIn It is un-American and unconstitutional, I will fight it with all my might.\"", "Stance": "Against order", "Name": "Rep. Anna G. Eshoo (D-Menlo Park)", "District": "18", "Source": "Twitter"}, {"Quote": "\"Perhaps most troubling, today’s executive order – issued on Holocaust Remembrance Day, no less – recalls a dark episode in American history. Just over 75 years ago, a ship called the St. Louis, carrying nearly a thousand Jews fleeing Nazi Germany, sailed so close to the United States that passengers could see the lights of Miami. But rather than welcome these refugees, America turned them away. Many of these Jewish refugees were killed by the Nazis when they were forced to return to Europe. Making sure that such a tragedy never happens again became the bedrock of U.S. and international refugee and asylum law and policy. Mr. Trump’s actions today upend this foundational principle and endanger millions all over the world.”", "Stance": "Against order", "Name": "Rep. Zoe Lofgren (D-San Jose)", "District": "19", "Source": "Statement"}, {"Quote": "\"President Trump’s executive actions are not reflective of our values. As a nation of immigrants, we are stronger because of our diversity, and when we come together in the name of inclusivity and equality, our voices cannot be silenced.\"", "Stance": "Against order", "Name": "Rep. Jimmy Panetta (D-Carmel)", "District": "20", "Source": "Statement"}, {"Quote": "\"Keeping my constituents safe is my highest priority and I support strengthening screening procedures to ensure Americans are protected from foreign threats. However, these issues are complex and should not be addressed through hasty, unclear Executive Actions. Instead, the President and Congress should work together towards a thoughtful, constructive solution to strengthen our national security while upholding our American values.\"", "Stance": "Critical, but unclear\n", "Name": "Rep. David Valadao (R-Hanford)", "District": "21", "Source": "Statement"}, {"Quote": "\"In light of attempts by jihadist groups to infiltrate fighters into refugee flows to the West, along with Europe’s tragic experience coping with this problem, the Trump Administration’s executive order on refugees is a common-sense security measure to prevent terror attacks on the homeland. While accommodations should be made for green card holders and those who’ve assisted the U.S. armed forces, this is a useful temporary measure on seven nations of concern until we can verify who is entering the United States.” ", "Stance": "For order", "Name": "Rep. Devin Nunes (R-Tulare)", "District": "22", "Source": "Statement"}, {"Quote": "No public comments and none provided when asked", "Stance": "Unclear", "Name": "Rep. Kevin McCarthy (R-Bakersfield)", "District": "23", "Source": ""}, {"Quote": "\"The reprehensible #MuslimBan, targeting immigrants & refugees b/c of religion isn't just immoral, but also undermines our national security.\"", "Stance": "Against order", "Name": "Rep. Salud Carbajal (D-Santa Barbara)", "District": "24", "Source": "Twitter"}, {"Quote": "No public comments and none provided when asked", "Stance": "Unclear", "Name": "Rep. Steve Knight (R-Palmdale)", "District": "25", "Source": ""}, {"Quote": "\"Shocked and appalled that @POTUS would deny entry to those who protect our troops. This is wrong & not who we are.\"", "Stance": "Against order", "Name": "Rep. Julia Brownley (D-Westlake Village)", "District": "26", "Source": "Twitter"}, {"Quote": "\"Mr. Trump continues to rely on the false justification that the U.S. cannot risk admitting refugees, when the reality is that the U.S. already has one of the strictest refugee vetting policies in the world. The refugees seeking asylum here are overwhelmingly children and parents who do not pose a threat to our country, but simply want a chance to live in peace, away from the horrors of war and refugee camps. For them, this policy is a death sentence.\"", "Stance": "Against order", "Name": "Rep. Judy Chu (D-Monterey Park)", "District": "27", "Source": "Statement"}, {"Quote": "\"President Trump would have this nation turn its back on those seeking refuge in their most desperate hour, and those who have risked their lives for America. He would do so by establishing a religious test, in a country founded on the ideal of religious liberty, and do so on Holocaust Remembrance Day. His actions are guided by fear and suspicion, not courage or compassion.\"", "Stance": "Against order", "Name": "Rep. Adam B. Schiff (D-Burbank)", "District": "28", "Source": "Statement"}, {"Quote": "\"Disturbed and angered by these reports. This President's actions are hateful. Anyone who said Trump is just full of hot air is mistaken. With a stroke of a pen he is proving that he can do tremendous damage to our country. His ego and recklessness are putting Americans in danger. I will not sit quietly by while he dismantles our democratic principles.\"", "Stance": "Against order", "Name": "Rep. Tony Cárdenas (D-Los Angeles)", "District": "29", "Source": "Facebook"}, {"Quote": "“What is particularly outrageous is that the order was applied to people who are legal permanent residents of the United States, commonly called 'green card holders.' The order was drafted in such a way that it could, but need not, be read to apply to these people, many of whom have been in the United States for years, have already been vetted, have jobs, businesses, families, and lives in the United States.\"", "Stance": "Against order", "Name": "Rep. Brad Sherman (D-Sherman Oaks)", "District": "30", "Source": "Statement"}, {"Quote": "\"This executive order will do nothing to make our country safer and only sends a message of hate and bigotry to the rest of the world. This order would not have prevented the attack in San Bernardino and the use of San Bernardino as justification for this anti-Muslim policy is a revolting way to exploit our community.\"", "Stance": "Against order", "Name": "Rep. Pete Aguilar (D-Redlands)", "District": "31", "Source": "Statement"}, {"Quote": "\"Barring entry to the United States based on religion or religious heritage is not only criminal, it is unconstitutional and un-American. This abhorrent view makes us less safe, adds fuel to the propaganda our enemies are using as a recruitment tool, and should be condemned by all. This impulsive decision was not thought-out or properly vetted, and it has created much hurt, anguish, and confusion. Proper coordination between agencies and advanced notice given to people involved could have prevented individuals from being detained at ports of entry the last two days.\"", "Stance": "Against order", "Name": "Rep. Grace F. Napolitano (D-Norwalk)", "District": "32", "Source": "Statement"}, {"Quote": "“Today’s executive order by President Trump using extreme vetting and banning refugees from many majority Muslim countries is offensive and a monumental waste of federal resources. Having served on active duty, we are taught that to defeat the enemy, we first need to know our enemy. Our enemies are terrorist groups such as ISIS and Al-Qaeda, not children, women and senior citizens fleeing those groups.”", "Stance": "Against order", "Name": "Rep. Ted Lieu (D-Torrance)", "District": "33", "Source": "Statement"}, {"Quote": "\"World class Doctors, translators who helped US forces, stopped at airports. #MuslimBan is shameful, un-American!\"", "Stance": "Against order", "Name": "Rep. Norma J. Torres (D-Pomona)", "District": "35", "Source": "Twitter"}, {"Quote": "\"The President's Executive Order is wrong and misguided. It threatens our moral clarity, American values, and national security. I am appalled by these actions and the very real human toll they will have on innocent families. I will support @ACLU's legal challenges. \"", "Stance": "Against order", "Name": "Rep. Raul Ruiz (D-Palm Desert)", "District": "36", "Source": "Facebook"}, {"Quote": "\"We must be better than this. This is not world leadership, this is living in fear with hatred in our hearts.\"", "Stance": "Against order", "Name": "Rep. Karen Bass (D-Los Angeles)", "District": "37", "Source": "Twitter"}, {"Quote": "\"The refugee ban does not make us safer. It erodes our American values and dims the light of freedom and liberty for the world. We are better than this.\"", "Stance": "Against order", "Name": "Rep. Linda T. Sanchez (D-Whittier)", "District": "38", "Source": "Facebook"}, {"Quote": "“I support measures to better guard against threats from terror hotspots and strengthen our vetting process, but I have serious concerns with the implementation of this executive order. It is now clear that proper coordination and communication with appropriate agencies and law enforcement did not occur. It is unacceptable that individuals — some of whom live in the U.S. and others who served alongside U.S. troops — have been needlessly delayed or even turned away.\" ", "Stance": "Critical of rollout", "Name": "Rep. Ed Royce (R-Fullerton)", "District": "39", "Source": "Statement"}, {"Quote": "\"The order’s masking of religious discrimination against refugees, legal permanent residents, and visa holders in the name of national security is reprehensible and illegal. It puts in place policies with astounding and inexcusable religious discrimination at levels not seen since World War II.\"", "Stance": "Against order", "Name": "Rep. Lucille Roybal-Allard (D-Downey)", "District": "40", "Source": "Statement"}, {"Quote": "\"As the descendent of parents and grandparents imprisoned in Japanese American internment camps, I am sickened by the use of collective punishment against all citizens of a certain nationality. This executive order is plainly un-American and plays to our worst instincts of tribalism and nationalism. On its own, this executive order marks a terrible moment for our country and a stain on our legacy.\"", "Stance": "Against order", "Name": "Rep. Mark Takano (D-Riverside)", "District": "41", "Source": "Statement"}, {"Quote": "\"For some time now, I’ve had serious concerns about the efficacy of the immigrant vetting process for nationals from certain countries, like Syria and Iraq. Some of these nations simply are not cooperative with providing information to our national security agencies, while others simply lack the technical capability to verify identification. That is why I do support a narrow, country-based pause until more strenuous vetting procedures can be put in place.\"", "Stance": "For order", "Name": "Rep. Ken Calvert (R-Corona)", "District": "42", "Source": "Statement"}, {"Quote": "\"Shame on Trump for closing the door on refugees fleeing violence from Assad in Syria whose attacks on children were aided by his ally Putin!\"", "Stance": "Against order", "Name": "Rep. Maxine Waters (D-Los Angeles)", "District": "43", "Source": "Twitter"}, {"Quote": "\"Great to see big crowds here @flyLAXairport today.  I'm headed back to D.C. to demand answers & that @POTUS withdraw EO  #MuslimBanprotest\"\n", "Stance": "Against order", "Name": "Rep. Nanette Barragán (D-San Pedro)", "District": "44", "Source": "Twitter"}, {"Quote": "\"The federal government’s primary responsibility is to protect national security. We must reevaluate the visa vetting process to ensure that our security measures are adequate to address the threats facing our nation.”\n ", "Stance": "Unclear", "Name": "Rep. Mimi Walters (R-Irvine)", "District": "45", "Source": "Statement\n"}, {"Quote": "\"This behavior goes against our American values and rights and cannot stand.\"", "Stance": "Against order", "Name": "Rep. Lou Correa (D-Santa Ana)", "District": "46", "Source": "Facebook"}, {"Quote": "“I condemn in the strongest terms the President’s executive order banning refugees and the citizens of Muslim nations. This ban, whether temporary or not, is shameful, wholly un-American at its core, and as written, unconstitutional. The history of our nation is one written by the refugee and the immigrant; people across the globe who fled religious persecution, war, famine, and poverty. People seeking a better life — one based not in fear, but in freedom and liberty. They chose America, which has long endured as the shining beacon on the hill. Sadly, that light was dimmed this weekend by the President's immigration executive order.\"", "Stance": "Against order", "Name": "Rep. Alan Lowenthal (D-Long Beach)", "District": "47", "Source": "Statement"}, {"Quote": "No public comments and none provided when asked", "Stance": "Unclear", "Name": "Rep. Dana Rohrabacher (R-Costa Mesa)", "District": "48", "Source": ""}, {"Quote": "\"A welcoming America is not incompatible with a strong and secure America. We can put in place a vetting process that the American people have confidence in. To do so, the Congress must work with the administration to swiftly reestablish strong and clear screening procedures so that our rich tradition of immigration is not permanently threatened by those who wish us harm.\"", "Stance": "Unclear", "Name": "Rep. Darrell Issa (R-Vista)", "District": "49", "Source": "Statement"}, {"Quote": "“It’s a necessary step toward regaining control of an immigration system that’s become a point of tremendous vulnerability.” Hunter's staff said he supports the intent, but questions how it was rolled out.", "Stance": "For order, but critical of rollout", "Name": "Rep. Duncan Hunter (R-Alpine)", "District": "50", "Source": "The Press-Enterprise"}, {"Quote": "\"Turning our backs on those who are seeking help is un-American. We are better than this. #MuslimBan\"", "Stance": "Against order", "Name": "Rep. Juan Vargas (D-San Diego)", "District": "51", "Source": "Twitter"}, {"Quote": "\"So-called ‘extreme-vetting’ has always been cover for policies based in fear and discrimination, particularly towards Muslims. Our rigorous vetting processes, which often take years to complete even for women and children, are the reason we don’t have to choose between security and being a haven for those seeking freedom and prosperity in America.\"", "Stance": "Against order", "Name": "Rep. Scott Peters (D-San Diego)", "District": "52", "Source": "Statement"}, {"Quote": "“Congress needs to take immediate action to repeal Trump’s Executive Order. The Muslim ban is a policy based on fear not strength. This order will do nothing to keep us safe. If anything, it will likely have the opposite effect. This executive order will also reduce the stature and influence America will have globally.\"", "Stance": "Against order", "Name": "Rep. Susan A. Davis (D-San Diego)", "District": "53", "Source": "Statement"}, {"Quote": "“The president’s blatantly discriminatory executive order should be rescinded immediately. The consequences of this order will be far-reaching and were obviously not carefully considered. People all around the world will be affected, including Americans.\"", "Stance": "Against order", "Name": "Sen. Dianne Feinstein (D-Calif.)", "District": "\n", "Source": "Statement"}, {"Quote": "“Make no mistake  this is a Muslim ban. Broad brush discrimination against refugees and immigrants from Muslim-majority countries, most of whom are women and children, runs counter to our national security interests, and will likely be used as a terrorist recruitment tool.\"", "Stance": "Against order", "Name": "Sen. Kamala Harris (D-Calif.)", "District": "", "Source": "Statement"}]